[Killed] BlockStatement
src/converter.js:2:1
 function LengthConverter(measurement, val)
-{
-    var result1, result2;
-
-    if(measurement == "feets")
-    {
-        result1 = (val*12).toFixed(2) + " inches";
-        result2 = (val/5280).toFixed(2) + " miles";
-    } else if(measurement === "inches") {
-        result1 = (val/12).toFixed(2) + " feets";
-        result2 = (val/63360).toFixed(2) + " miles";
-    } else if(measurement === "miles") {
-        result1 = (val*5280).toFixed(2) + " feets";
-        result2 = (val*63360).toFixed(2) + " inches";
-    } else {
-        return "wrong input";
-    }
-    return [result1, result2];
-}
+{}
 
 // console.log(LengthConverter("feets", 3));
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/converter.test.js

  ● LengthConverter › converts feet to inches and miles correctly

[Killed] ConditionalExpression
src/converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "feets")
+    if(true)
     {
         result1 = (val*12).toFixed(2) + " inches";
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


PASS test/loan.test.js

PASS test/sorting.test.js

[Killed] EqualityOperator
src/converter.js:5:8
 {
     var result1, result2;
 
-    if(measurement == "feets")
+    if(measurement != "feets")
     {
         result1 = (val*12).toFixed(2) + " inches";
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


PASS test/loan.test.js

FAIL test/converter.test.js
  ● LengthConverter › converts feet to inches and miles correctly

[Killed] BlockStatement
src/converter.js:6:5
     var result1, result2;
 
     if(measurement == "feets")
-    {
-        result1 = (val*12).toFixed(2) + " inches";
-        result2 = (val/5280).toFixed(2) + " miles";
-    } else if(measurement === "inches") {
+    {} else if(measurement === "inches") {
         result1 = (val/12).toFixed(2) + " feets";
         result2 = (val/63360).toFixed(2) + " miles";
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


Error: An error occurred while adding the reporter at path "C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\node_modules\jest-html-reporters\index.js".
ENOTEMPTY: directory not empty, rmdir 'C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\.stryker-tmp\sandbox6421098\jest-html-reporters-a

[Killed] ArithmeticOperator
src/converter.js:7:20
 
     if(measurement == "feets")
     {
-        result1 = (val*12).toFixed(2) + " inches";
+        result1 = (val / 12).toFixed(2) + " inches";
         result2 = (val/5280).toFixed(2) + " miles";
     } else if(measurement === "inches") {
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


PASS test/sorting.test.js

FAIL test/converter.test.js
  ● LengthConverter › converts feet to inches and miles correctly

[Killed] StringLiteral
src/converter.js:8:43
     if(measurement == "feets")
     {
         result1 = (val*12).toFixed(2) + " inches";
-        result2 = (val/5280).toFixed(2) + " miles";
+        result2 = (val/5280).toFixed(2) + "";
     } else if(measurement === "inches") {
         result1 = (val/12).toFixed(2) + " feets";
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


PASS test/sorting.test.js

FAIL test/converter.test.js
  ● LengthConverter › converts feet to inches and miles correctly

[Killed] EqualityOperator
src/converter.js:9:15
     {
         result1 = (val*12).toFixed(2) + " inches";
         result2 = (val/5280).toFixed(2) + " miles";
-    } else if(measurement === "inches") {
+    } else if(measurement !== "inches") {
         result1 = (val/12).toFixed(2) + " feets";
         result2 = (val/63360).toFixed(2) + " miles";
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


PASS test/sorting.test.js

FAIL test/converter.test.js
  ● LengthConverter › converts inches to feet and miles correctly

[Killed] BlockStatement
src/converter.js:9:41
     {
         result1 = (val*12).toFixed(2) + " inches";
         result2 = (val/5280).toFixed(2) + " miles";
-    } else if(measurement === "inches") {
-        result1 = (val/12).toFixed(2) + " feets";
-        result2 = (val/63360).toFixed(2) + " miles";
-    } else if(measurement === "miles") {
+    } else if(measurement === "inches") {} else if(measurement === "miles") {
         result1 = (val*5280).toFixed(2) + " feets";
         result2 = (val*63360).toFixed(2) + " inches";
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


PASS test/sorting.test.js

FAIL test/converter.test.js
  ● LengthConverter › converts inches to feet and miles correctly

[Killed] StringLiteral
src/converter.js:11:44
         result2 = (val/5280).toFixed(2) + " miles";
     } else if(measurement === "inches") {
         result1 = (val/12).toFixed(2) + " feets";
-        result2 = (val/63360).toFixed(2) + " miles";
+        result2 = (val/63360).toFixed(2) + "";
     } else if(measurement === "miles") {
         result1 = (val*5280).toFixed(2) + " feets";
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/converter.test.js

  ● LengthConverter › converts inches to feet and miles correctly

[Killed] EqualityOperator
src/converter.js:12:15
     } else if(measurement === "inches") {
         result1 = (val/12).toFixed(2) + " feets";
         result2 = (val/63360).toFixed(2) + " miles";
-    } else if(measurement === "miles") {
+    } else if(measurement !== "miles") {
         result1 = (val*5280).toFixed(2) + " feets";
         result2 = (val*63360).toFixed(2) + " inches";
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


Error: An error occurred while adding the reporter at path "C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\node_modules\jest-html-reporters\index.js".
ENOTEMPTY: directory not empty, rmdir 'C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\.stryker-tmp\sandbox6421098\jest-html-reporters-a

[Killed] ObjectLiteral
src/converter.js:22:18
 }
 
 // console.log(LengthConverter("feets", 3));
-module.exports = {
-    LengthConverter
-}
+module.exports = {}
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/converter.test.js

  ● LengthConverter › converts feet to inches and miles correctly
