[Killed] BlockStatement
src/loan.js:2:1
 function calculateLoan(LoanAmount, interestRate, MonthToPay)
-{
-    if((LoanAmount === '') || (LoanAmount < 0) || (isNaN(LoanAmount))){
-        return "Please provide a valid loan amount"; 
-    } else if((interestRate === '') || (interestRate < 0) || (isNaN(interestRate))){
-        return "Please provide a valid interestRate"; 
-    } else if((MonthToPay === '') || (MonthToPay < 0) || (isNaN(MonthToPay))){
-        return "Please provide a valid month"; 
-    } else {
-        const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-        let payment = ((LoanAmount / MonthToPay) + interest).toFixed(2);
-        return payment;
-    }
-}
+{}
 // console.log(calculateLoan(1000,0.1, 12));
 
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


PASS test/converter.test.js

PASS test/sorting.test.js

[Killed] EqualityOperator
src/loan.js:3:9
 function calculateLoan(LoanAmount, interestRate, MonthToPay)
 {
-    if((LoanAmount === '') || (LoanAmount < 0) || (isNaN(LoanAmount))){
+    if((LoanAmount !== '') || (LoanAmount < 0) || (isNaN(LoanAmount))){
         return "Please provide a valid loan amount"; 
     } else if((interestRate === '') || (interestRate < 0) || (isNaN(interestRate))){
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


Error: An error occurred while adding the reporter at path "C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\node_modules\jest-html-reporters\index.js".
ENOTEMPTY: directory not empty, rmdir 'C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\.stryker-tmp\sandbox6421098\jest-html-reporters-a

[Killed] EqualityOperator
src/loan.js:3:32
 function calculateLoan(LoanAmount, interestRate, MonthToPay)
 {
-    if((LoanAmount === '') || (LoanAmount < 0) || (isNaN(LoanAmount))){
+    if((LoanAmount === '') || (LoanAmount >= 0) || (isNaN(LoanAmount))){
         return "Please provide a valid loan amount"; 
     } else if((interestRate === '') || (interestRate < 0) || (isNaN(interestRate))){
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


Error: An error occurred while adding the reporter at path "C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\node_modules\jest-html-reporters\index.js".
ENOTEMPTY: directory not empty, rmdir 'C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\.stryker-tmp\sandbox6421098\jest-html-reporters-a

[Killed] ConditionalExpression
src/loan.js:5:15
 {
     if((LoanAmount === '') || (LoanAmount < 0) || (isNaN(LoanAmount))){
         return "Please provide a valid loan amount"; 
-    } else if((interestRate === '') || (interestRate < 0) || (isNaN(interestRate))){
+    } else if(false){
         return "Please provide a valid interestRate"; 
     } else if((MonthToPay === '') || (MonthToPay < 0) || (isNaN(MonthToPay))){
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


Error: An error occurred while adding the reporter at path "C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\node_modules\jest-html-reporters\index.js".
ENOTEMPTY: directory not empty, rmdir 'C:\Users\pc\Documents\4-2\CSE 4806_Software Verification and Validation Lab\calculator\.stryker-tmp\sandbox6421098\jest-html-reporters-a

[Killed] ConditionalExpression
src/loan.js:5:15
 {
     if((LoanAmount === '') || (LoanAmount < 0) || (isNaN(LoanAmount))){
         return "Please provide a valid loan amount"; 
-    } else if((interestRate === '') || (interestRate < 0) || (isNaN(interestRate))){
+    } else if(false || (isNaN(interestRate))){
         return "Please provide a valid interestRate"; 
     } else if((MonthToPay === '') || (MonthToPay < 0) || (isNaN(MonthToPay))){
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/loan.test.js

  ● calculateLoan › handles invalid interest rate

[Killed] ConditionalExpression
src/loan.js:7:15
         return "Please provide a valid loan amount"; 
     } else if((interestRate === '') || (interestRate < 0) || (isNaN(interestRate))){
         return "Please provide a valid interestRate"; 
-    } else if((MonthToPay === '') || (MonthToPay < 0) || (isNaN(MonthToPay))){
+    } else if(false){
         return "Please provide a valid month"; 
     } else {
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/loan.test.js

  ● calculateLoan › handles invalid month

[Killed] ConditionalExpression
src/loan.js:7:15
         return "Please provide a valid loan amount"; 
     } else if((interestRate === '') || (interestRate < 0) || (isNaN(interestRate))){
         return "Please provide a valid interestRate"; 
-    } else if((MonthToPay === '') || (MonthToPay < 0) || (isNaN(MonthToPay))){
+    } else if(false || (isNaN(MonthToPay))){
         return "Please provide a valid month"; 
     } else {
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/loan.test.js

  ● calculateLoan › handles invalid month

[Killed] BlockStatement
src/loan.js:9:12
         return "Please provide a valid interestRate"; 
     } else if((MonthToPay === '') || (MonthToPay < 0) || (isNaN(MonthToPay))){
         return "Please provide a valid month"; 
-    } else {
-        const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-        let payment = ((LoanAmount / MonthToPay) + interest).toFixed(2);
-        return payment;
-    }
+    } else {}
 }
 // console.log(calculateLoan(1000,0.1, 12));
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/loan.test.js

  ● calculateLoan › calculates monthly payment correctly for positive values

[Killed] ArithmeticOperator
src/loan.js:11:24
         return "Please provide a valid month"; 
     } else {
         const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-        let payment = ((LoanAmount / MonthToPay) + interest).toFixed(2);
+        let payment = (LoanAmount / MonthToPay - interest).toFixed(2);
         return payment;
     }
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/loan.test.js

  ● calculateLoan › calculates monthly payment correctly for positive values

[Killed] ArithmeticOperator
src/loan.js:11:25
         return "Please provide a valid month"; 
     } else {
         const interest = (LoanAmount * (interestRate * 0.01)) / MonthToPay;
-        let payment = ((LoanAmount / MonthToPay) + interest).toFixed(2);
+        let payment = ((LoanAmount * MonthToPay) + interest).toFixed(2);
         return payment;
     }
killedBy: All tests
statusReason: > calculator@1.0.0 test
> jest


FAIL test/loan.test.js

  ● calculateLoan › calculates monthly payment correctly for positive values
